clear all;close all;clc;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%本程序的功能是宽带信号的波束形成模拟仿真
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

fs=6000;c=1500;
N=16;
d=1;

%利用随机信号和滤波器产生宽带信号
x=randn(1,6000);
b=fir1(100,[400/(fs/2),700/(fs/2)]);%带宽400-700Hz
s=filter(b,1,x);
theta_0=-30;%声源在-30度方向

%仿真基阵接受信号
for n=1:N
    tao(n)=round((n-1)*d*sind(theta_0)/1500*fs);
    y(n,:)=s(1000+tao(n):5000+tao(n));
end

%时域波束形成
for theta=-90:90
    for n=1:N
        tao(n)=round((n-1)*d*sind(theta)/c*fs);
        yy(n,:)=y(n,1000-tao(n):3000-tao(n));%由于sind(theta)可正可负，所以两端要有余量
    end
    arr=sum(yy);
    beam(theta+91)=sum(arr.^2);%beam是一个数组，序列号必须是正，所以要+91
end

%作图
plot((-90:90),beam)